// MahsolShowcase.jsx
import React from "react";
import ProductCard from "./ProductCard";

const products = [
  {
    id: 601,
    title: "بتونه",
    price: "۲۵۰٬۰۰۰",
    image: "/img/02.jpg",
      description: "عایق‌های الاستومری رطوبتی، برودتی و حرارتی، جایگزین ۱۰۰٪ قیر و ایزوگام. دارای رنگ‌بندی دلخواه مشتری و مناسب برای انواع نمای داخلی و خارجی. قابل استفاده بر روی سطوح آهنی، سیمانی، سنگی، چوبی و ... . ایده‌آل برای آب‌بندی مخازن، لوله‌ها، سقف‌های شیروانی، پشت‌بام‌ها، دیوارهای باران‌گیر، نماها، استخر و سایر سطوح حساس به رطوبت. دارای خاصیت ضدآب و آب‌گریزی، مناسب جهت پوشش‌دهی سطوح آجرنما، چوبی، سیمانی و سنگی برای جلوگیری و رفع نم. آنتی‌باکتریال، ضد اشعه UV و سازگار با محیط زیست. همچنین قابلیت ترکیب با انواع پودرهای نانو و سیمانی برای تقویت آب‌بندی را دارا می‌باشد."
,
    rating: 4,
    images: [
      "/img/batonhame.jpg",
      "/img/02.jpg",
     
    ],
  },
  
  {
    id: 601,
    title: "بتونه قرمز",
    price: "۲۵۰٬۰۰۰",
    image: "/img/01.jpg",
      description: "عایق‌های الاستومری رطوبتی، برودتی و حرارتی، جایگزین ۱۰۰٪ قیر و ایزوگام. دارای رنگ‌بندی دلخواه مشتری و مناسب برای انواع نمای داخلی و خارجی. قابل استفاده بر روی سطوح آهنی، سیمانی، سنگی، چوبی و ... . ایده‌آل برای آب‌بندی مخازن، لوله‌ها، سقف‌های شیروانی، پشت‌بام‌ها، دیوارهای باران‌گیر، نماها، استخر و سایر سطوح حساس به رطوبت. دارای خاصیت ضدآب و آب‌گریزی، مناسب جهت پوشش‌دهی سطوح آجرنما، چوبی، سیمانی و سنگی برای جلوگیری و رفع نم. آنتی‌باکتریال، ضد اشعه UV و سازگار با محیط زیست. همچنین قابلیت ترکیب با انواع پودرهای نانو و سیمانی برای تقویت آب‌بندی را دارا می‌باشد."
,
    rating: 4,
    images: [
      "/img/عایق نانو الاستومری.jpg",
      "/img/01.jpg",
     
    ],
  },
  {
    id: 403,
    title: "بتونه زرد",
    price: "۱۵۰٬۰۰۰",
    image: "/img/09.jpg",
    description: "عایق‌های الاستومری رطوبتی، برودتی و حرارتی، جایگزین ۱۰۰٪ قیر و ایزوگام. دارای رنگ‌بندی دلخواه مشتری و مناسب برای انواع نمای داخلی و خارجی. قابل استفاده بر روی سطوح آهنی، سیمانی، سنگی، چوبی و ... . ایده‌آل برای آب‌بندی مخازن، لوله‌ها، سقف‌های شیروانی، پشت‌بام‌ها، دیوارهای باران‌گیر، نماها، استخر و سایر سطوح حساس به رطوبت. دارای خاصیت ضدآب و آب‌گریزی، مناسب جهت پوشش‌دهی سطوح آجرنما، چوبی، سیمانی و سنگی برای جلوگیری و رفع نم. آنتی‌باکتریال، ضد اشعه UV و سازگار با محیط زیست. همچنین قابلیت ترکیب با انواع پودرهای نانو و سیمانی برای تقویت آب‌بندی را دارا می‌باشد."
,
    rating: 3,
    images: [
      "/img/IMG_5820.JPG",
      "/img/09.jpg",
      
    ],
  },
];

function MahsolShowcase() {
  return (
    <div className="product-list">
      {products.map((item) => (
        <ProductCard
          key={item.id}
          id={item.id}
          title={item.title}
          price={item.price}
          image={item.image}
          description={item.description}
          images={item.images}
          rating={item.rating}
        />
      ))}
    </div>
  );
}

export default MahsolShowcase;
